[{"id":5,"name":"Peter Bak","title":"Chief Information Officer","organization":"Humber River Health","email":"","phone":"","interest":"AI / Digital Hospital","source":"Mira Research - Canadian CIO of the Year, first fully digital hospital in NA","notes":"🎯 SIGNAL: Built North America's FIRST fully digital hospital. Canadian CIO of the Year 2016. PhD in applied engineering. Recently adopted AI for coding/auditing (50%+ efficiency gain). HUGE credibility in Ontario health IT circles.\n\n📍 Toronto, ON\n📧 Contact via Humber River Health","created_at":"2026-02-11 15:47:55","region":"ontario","country":"Canada","mira_notes":"HIGH VALUE TARGET. Peter is THE Ontario digital health pioneer. His endorsement would open doors across the province. Approach with respect for his expertise — he's been doing this longer than most.","mira_unread":0,"next_action":"","next_action_date":null,"status":"new","linkedin":"linkedin.com/in/peterbak41618","proposed_outreach":"Peter — your work at Humber River set the standard for what digital hospitals can be. The AI coding efficiency gains caught my attention. I've been building decision assurance frameworks for clinical AI — essentially governance at runtime, not just strategy docs. Given HRH's track record of being first, thought you might have perspective on where AI governance is heading. Coffee?"},
{"id":6,"name":"Sam Fielding","title":"Chief Information Officer","organization":"Southlake Regional Health Centre","email":"","phone":"","interest":"Interoperability / Data Exchange","source":"Mira Research - 2025 MUSE Board Chair, Project AMPLIFI lead","notes":"🎯 SIGNAL: 2025 MUSE International Board Chair. Leading Project AMPLIFI (Ontario interoperability). Championing Traverse Exchange for hospital-LTC data sharing. 10+ years CTO at Horizon Health Network. MEDITECH ecosystem leader.\n\n📍 Newmarket, ON\n📧 Contact via Southlake","created_at":"2026-02-11 15:47:55","region":"ontario","country":"Canada","mira_notes":"Strong MEDITECH connection. If LUMEN SDK could integrate with MEDITECH workflows, Sam is the connector. Interoperability focus aligns with SDK value prop — data flowing means more AI decisions to govern.","mira_unread":0,"next_action":"","next_action_date":null,"status":"new","linkedin":"linkedin.com/in/sam-fielding","proposed_outreach":"Sam — congrats on the MUSE Board Chair role. Your work on Traverse Exchange is exactly what Ontario needs — data actually flowing between hospitals and LTC. I've been thinking about the governance layer that sits on top of interoperability — making sure the AI decisions using that connected data are defensible. Would value your perspective on where the gaps are."},
{"id":7,"name":"Evan Lyons","title":"VP Digital Information Services & CIO","organization":"Peterborough Regional Health Centre","email":"elyons@prhc.on.ca","phone":"","interest":"AI / Epic / Analytics","source":"Mira Research - HIMSS 2026 speaker, Epic implementation, AI focus","notes":"🎯 SIGNAL: Joined PRHC Jan 2024 — still settling into role. Speaking at HIMSS 2026. Epic EHR implementation. Background in analytics (Ontario Securities Commission). Peterborough native — community-focused.\n\n📍 Peterborough, ON\n📧 elyons@prhc.on.ca","created_at":"2026-02-11 15:48:14","region":"ontario","country":"Canada","mira_notes":"Newer to role (Jan 2024) — may be more open to external input. Analytics background means he'll appreciate data-driven approaches. HIMSS speaker = visibility seeker, good for case study potential.","mira_unread":0,"next_action":"","next_action_date":null,"status":"new","linkedin":"linkedin.com/in/evan-lyons-a4b88480","proposed_outreach":"Evan — saw you're speaking at HIMSS 2026. Your analytics background at OSC is interesting — not many CIOs come from that angle. As you're building out Epic at PRHC, curious if you're thinking about governance for AI-assisted decisions. It's the gap I keep seeing in Ontario implementations. Happy to share patterns if useful."},
{"id":8,"name":"Mark Farrow","title":"Interim Regional CIO","organization":"Bridge Northwest (Northwestern Ontario Hospitals)","email":"","phone":"","interest":"AI Health Solutions / MEDITECH","source":"Mira Research - Appointed Nov 2025, former Oak Valley Health, AI solutions focus","notes":"🎯 SIGNAL: Just appointed Nov 2025 — FRESH in role. Leading MEDITECH Expanse implementation. Explicit focus on AI-based health solutions. Previously at Oak Valley Health (2022-2024) and Hamilton Health Sciences. Regional role = multiple hospitals.\n\n📍 Northwestern Ontario\n📧 Contact via Bridge Northwest","created_at":"2026-02-11 15:48:14","region":"ontario","country":"Canada","mira_notes":"VERY new in role (Nov 2025) — prime window to influence thinking. Oak Valley Health connection = Sean may have overlap (Felix Zhang is OVH CIO). Regional role means bigger impact if we land it.","mira_unread":0,"next_action":"","next_action_date":null,"status":"new","linkedin":"linkedin.com/in/markfarrow22","proposed_outreach":"Mark — congrats on the Bridge Northwest role. Regional CIO across multiple hospitals is no small mandate. Saw you're focused on AI-based health solutions alongside the MEDITECH rollout. I've been building frameworks for AI decision governance — the part that comes after the model is deployed. If you're thinking about how to scale AI responsibly across the region, happy to compare notes."},
{"id":9,"name":"Angela Tibando","title":"SVP, Digital Excellence in Health","organization":"Ontario Health","email":"","phone":"","interest":"Provincial Digital Strategy","source":"Mira Research - Provincial digital health leadership, Board-level","notes":"🎯 SIGNAL: Senior VP at Ontario Health — provincial-level influence. Digital Excellence mandate. Reports to CEO Matthew Anderson. If Ontario Health adopts SDK standards, it flows to all hospitals.\n\n📍 Provincial (Toronto HQ)\n📧 Contact via Ontario Health","created_at":"2026-02-11 15:48:30","region":"ontario","country":"Canada","mira_notes":"STRATEGIC TARGET. Provincial level = policy influence. If OH endorses or adopts LUMEN/SDK approach, it becomes the standard. Harder to reach but highest leverage.","mira_unread":0,"next_action":"","next_action_date":null,"status":"new","linkedin":"","proposed_outreach":"Angela — FORGE Health has been working with several Ontario hospitals on AI activation. I'm seeing a pattern: everyone's doing AI pilots, but there's no consistent governance framework for clinical AI decisions. Ontario Health is uniquely positioned to set that standard. Would welcome 20 minutes to share what we're seeing on the ground."},
{"id":10,"name":"Chris Akeroyd","title":"Chief Information Officer","organization":"Lee Health","email":"","phone":"","interest":"Digital Transformation","source":"Mira Research - New CIO June 2025, 10 years at Children's Health Dallas","notes":"🎯 SIGNAL: New in role (June 2025). Came from 10 years transforming Children's Health Dallas. Lee Health is major FL system (Fort Myers). New CIOs have mandate + budget.\n\n📍 Fort Myers, FL","created_at":"2026-02-11 15:48:30","region":"us","country":"USA","mira_notes":"Strong candidate for US expansion. Children's Health experience = understands complex health systems. New in role = evaluating vendors.","mira_unread":0,"next_action":"","next_action_date":null,"status":"new","linkedin":"linkedin.com/in/cakeroyd","proposed_outreach":"Chris — congrats on the move to Lee Health. After a decade transforming Children's Health, you're probably already seeing where the AI pilots are stuck. I've been helping Ontario health systems escape that exact pilot purgatory — happy to share what's working if useful. No pitch, just patterns from the field."}]
