[{"id":1,"title":"SDK Competitive Intelligence — Jan 2026","content":"KEY FINDING: Gap is real but closing. Superwise.ai is closest threat (runtime guardrails for healthcare, real customers). BuildToValue is open-source governance middleware. Neither has MCDA+Monte Carlo scoring, CHAI domain alignment, or PHIPA compliance packs.\n\nACTION: Move fast on SDK extraction. Consider CHAI membership. Potential Superwise partnership (they monitor post-deploy, we validate pre-deploy).\n\n@Mira: research Superwise new funding round.\n→ MIRA (Feb 11, 10:15am): Superwise raised only $4.5M seed (March 2020), then was ACQUIRED in Jan 2023. No Series B. Total funding: $4.5M. They got IDC MarketScape \"Major Player\" recognition in 2025 but no new capital. Much smaller than I initially thought — this changes the competitive picture. They're bootstrapped/acquired, not VC-backed growth mode. Partnership angle may be more viable than I assumed.","category":"strategy","pinned":1,"created_at":"2026-02-01 05:45:52","updated_at":"2026-02-11 15:26:08","mira_unread":1},
{"id":2,"title":"LinkedIn Outreach — CIO Reconnection (Warm Lead)","content":"**USE CASE:** Reconnecting with a CIO you have met before at industry events\n\n**TEMPLATE — Shalu Bains, Trillium HP (Feb 2026):**\n\n---\n\nHi Shalu,\n\nHope you're well! We crossed paths a few times during my Microsoft days — your work at Trillium has always stood out, and congrats on the ORBIE recognition last year.\n\nI've since launched FORGE Health, focused entirely on helping Ontario hospitals move AI from pilot purgatory to real impact. Given your analytics and AI mandate, I'd love to reconnect and hear what you're seeing on the ground.\n\n20 minutes to compare notes?\n\nBest,\nSean\n\n---\n\n**WHY IT WORKS:**\n- Warm opener (shared history)\n- Brief credibility (FORGE, Ontario focus)\n- \"Pilot purgatory\" = resonates with CIOs\n- Low-pressure ask\n- No links/attachments (avoids spam filters)\n\n**VARIATIONS:**\n- Swap ORBIE mention for recent news/initiative if applicable\n- Add specific pain point if known (e.g., \"I know Trillium has been exploring clinical AI...\")","category":"outreach-templates","pinned":0,"created_at":"2026-02-11 14:48:01","updated_at":"2026-02-11 14:48:01","mira_unread":0}]
